{
    "aardvark": "Also called : ant bear a nocturnal mammal, Orycteropus afer, the sole member of its family (Orycteropodidae) and order (Tubulidentata). It inhabits the grasslands of Africa, has long ears and snout, and feeds on termites",
    "albatross": "An albatross is a very large white seabird.",
    "alligator": "An alligator is a large reptile with short legs, a long tail and very powerful jaws.",
    "alpaca": "Alpaca is a type of soft wool.",
    "anaconda": "a very large nonvenomous arboreal and semiaquatic snake, Eunectes murinus, of tropical South America, which kills its prey by constriction: family Boidae (boas)",
    "anteater": "An anteater is an animal with a long nose that eats termites or ants. Anteaters live in warm countries.",
    "antelope": "An antelope is an animal like a deer, with long legs and horns, that lives in Africa or Asia. Antelopes are graceful and can run fast. There are many different types of antelope.",
    "arctic fox": "a fox, Alopex lagopus, of arctic regions, whose fur is dark grey in the summer and white in the winter See also blue fox",
    "armadillo": "An armadillo is a small animal whose body is covered with large bony scales and which rolls itself into a ball when it is attacked. Armadillos are mainly found in South and Central America.",
    "baboon": "A baboon is a large monkey that lives in Africa.",
    "bactrian camel": "a two-humped camel, Camelus bactrianus, used as a beast of burden in the cold deserts of central Asia Compare Arabian camel",
    "badger": "A badger is a wild animal which has a white head with two wide black stripes on it. Badgers live underground and usually come up to fee...",
    "bald eagle": "A bald eagle is a large eagle with a white head that lives in North America. It is the national bird of the United States of America.",
    "basking shark": "Also called : sailfish a very large plankton-eating shark, Cetorhinus maximus, often floating at the sea surface: family Cetorhinidae",
    "bass": "A bass is a man with a very deep singing voice.",
    "bat": "A bat is a specially shaped piece of wood that is used for hitting the ball in baseball, softball, cricket, rounders, or table tennis.",
    "bear": "If you bear something somewhere, you carry it there or take it there.",
    "bellbird": "any of several tropical American passerine birds of the genus Procnias having a bell-like call: family Cotingidae (cotingas)",
    "bison": "A bison is a large hairy animal with a large head that is a member of the cattle family. They used to be very common in North America and Europe.",
    "black snake": "any of several Old World black venomous elapid snakes, esp Pseudechis porphyriacus (Australian blacksnake)",
    "blackbird": "A blackbird is a common European bird. The male has black feathers and a yellow beak, and the female has brown feathers.",
    "blesbok": "an antelope, Damaliscus dorcas (or albifrons), of southern Africa. The coat is a deep reddish-brown with a white blaze between the eyes; the horns are lyre-shaped",
    "bluebird": "any North American songbird of the genus Sialia, having a blue or partly blue plumage: subfamily Turdinae (thrushes)",
    "bullfrog": "A bullfrog is a type of large frog which makes a very loud noise.",
    "bush pig": "Also called : boschvark a wild pig, Potamochoerus porcus, inhabiting forests in tropical Africa and Madagascar. It is brown or black, with pale markings on the face",
    "camel": "A camel is a large animal that lives in deserts and is used for carrying goods and people. Camels have long necks and one or two lumps on their backs called humps.",
    "cape buffalo": "another name for buffalo (sense 1)",
    "cat": "A cat is a furry animal that has a long tail and sharp claws. Cats are often kept as pets.",
    "catfish": "Catfish are a type of fish that have long thin spines around their mouths.",
    "chameleon": "A chameleon is a kind of lizard whose skin changes colour to match the colour of its surroundings.",
    "cheetah": "A cheetah is a wild animal that looks like a large cat with black spots on its body. Cheetahs can run very fast.",
    "chickadee": "any of various small North American songbirds of the genus Parus, such as P. atricapillus (black-capped chickadee), typically having grey-and-black plumage: family Paridae (titmice)",
    "chicken": "Chickens are birds which are kept on a farm for their eggs and for their meat.",
    "cockatoo": "A cockatoo is a kind of parrot from Australia or New Guinea which has a bunch of feathers called a crest on its head.",
    "cockroach": "A cockroach is a large brown insect that is sometimes found in warm places or where food is kept.",
    "coelacanth": "a primitive marine bony fish of the genus Latimeria (subclass Crossopterygii), having fleshy limblike pectoral fins and occurring off the coast of E Africa: thought to be extinct until a living specimen was discovered in 1938",
    "collared lizard": "A lizard is a reptile with short legs and a long tail.",
    "columbiform": "Having the form of a dove or pigeon.",
    "corn snake": "A species of rat snake",
    "cow": "A cow is a large female animal that is kept on farms for its milk. People sometimes refer to male and female animals of this species as cows.",
    "coyote": "A coyote is a small wolf which lives in the plains of North America.",
    "crane": "A crane is a large machine that moves heavy things by lifting them in the air.",
    "crocodile bird": "an African courser, Pluvianus aegyptius, that lives close to rivers and is thought to feed on insects parasitic on crocodiles",
    "crow": "A crow is a large black bird which makes a loud, harsh noise.",
    "deer": "A deer is a large wild animal that eats grass and leaves. A male deer usually has large, branching horns.",
    "dingo": "A dingo is an Australian wild dog.",
    "dog": "A dog is a very common four-legged animal that is often kept by people as a pet or to guard or hunt. There are many different breeds of dog.",
    "dolphin": "A dolphin is a mammal which lives in the sea and looks like a large fish with a pointed mouth.",
    "donkey": "A donkey is an animal which is like a horse but which is smaller and has longer ears.",
    "dory": "any spiny-finned marine teleost food fish of the family Zeidae, esp the John Dory, having a deep compressed body",
    "dove": "A dove is a bird that looks like pigeon but is smaller and lighter in colour. Doves are often used as a symbol of peace.",
    "duck": "A duck is a very common water bird with short legs, a short neck, and a large flat beak.",
    "eagle": "An eagle is a large bird that lives by eating small animals.",
    "eel": "An eel is a long, thin fish that looks like a snake.",
    "egret": "any of various wading birds of the genera Egretta, Hydranassa, etc, that are similar to herons but usually have a white plumage and, in the breeding season, long feathery plumes: family Ardeidae, order Ciconiiformes See also aigrette",
    "eland": "a large spiral-horned antelope, Taurotragus oryx, inhabiting bushland in eastern and southern Africa. It has a dewlap and a hump on the shoulders a...",
    "elephant": "An elephant is a very large animal with a long, flexible nose called a trunk, which it uses to pick up things. Elephants live in India and Africa.",
    "elephant seal": "either of two large earless seals, Mirounga leonina of southern oceans or M. angustirostris of the N Atlantic, the males of which have a long trunklike snout",
    "elk": "An elk is a type of large deer. Elks have big, flat horns called antlers and are found in Northern Europe, Asia, and North America. Some British speakers use elk to refer to the European and Asian varieties of this animal, and moose to refer to the North American variety.",
    "emperor penguin": "an Antarctic penguin, Aptenodytes forsteri, with orange-yellow patches on the neck: the largest penguin, reaching a height of 1.3 m (4 ft)",
    "emu": "An emu is a large Australian bird which cannot fly.",
    "ermine": "Ermine is expensive white fur that comes from small animals called stoats.",
    "falcon": "A falcon is a bird of prey that can be trained to hunt other birds and animals.",
    "fennec": "a very small nocturnal fox, Fennecus zerda, inhabiting deserts of N Africa and Arabia, having pale fur and enormous ears",
    "ferret": "A ferret is a small, fierce animal which is used for hunting rabbits and rats.",
    "filefish": "any tropical triggerfish, such as Alutera scripta, having a narrow compressed body and a very long dorsal spine",
    "finch": "A finch is a small bird with a short strong beak.",
    "flamingo": "A flamingo is a bird with pink feathers, long thin legs, a long neck, and a curved beak. Flamingos live near water in warm countries.",
    "fox": "A fox is a wild animal which looks like a dog and has reddish-brown fur, a pointed face and ears, and a thick tail. Foxes eat smaller a...",
    "frog": "A frog is a small creature with smooth skin, big eyes, and long back legs which it uses for jumping. Frogs usually live near water.",
    "gazelle": "A gazelle is a type of small African or Asian deer. Gazelles move very quickly and gracefully.",
    "gecko": "any small insectivorous terrestrial lizard of the family Gekkonidae, of warm regions. The digits have adhesive pads, which enable these animals to climb on smooth surfaces",
    "gila monster": "a large venomous brightly coloured lizard, Heloderma suspectum, inhabiting deserts of the southwestern US and Mexico and feeding mostly on eggs and small mammals: family Helodermatidae",
    "giraffe": "A giraffe is a large African animal with a very long neck, long legs, and dark patches on its body.",
    "gnu": "A gnu is a large African deer.",
    "goat": "A goat is a farm animal or a wild animal that is about the size of a sheep. Goats have horns, and hairs on their chin which resemble a beard.",
    "goldfinch": "a common European finch, Carduelis carduelis, the adult of which has a red-and-white face and yellow-and-black wings",
    "goldfish": "Goldfish are small gold or orange fish which are often kept as pets.",
    "goose": "A goose is a large bird that has a long neck and webbed feet. Geese are often farmed for their meat.",
    "greenland shark": "a large shark that inhabits the northern Atlantic Ocean.",
    "guinea fowl": "A guinea fowl is a large grey African bird that is often eaten as food.",
    "gull": "A gull is a common sea bird.",
    "hammerhead shark": "Any of various sharks of the genus ''Sphyrna'' having the eyes set on projections from the sides of the head, which gives it a hammer shape.",
    "hare": "A hare is an animal like a rabbit but larger with long ears, long legs, and a small tail.",
    "hawk": "A hawk is a large bird with a short, hooked beak, sharp claws, and very good eyesight. Hawks catch and eat small birds and animals.",
    "hedgehog": "A hedgehog is a small brown animal with sharp spikes covering its back.",
    "hen": "A hen is a female chicken. People often keep hens in order to eat them or sell their eggs.",
    "heron": "A heron is a large bird which has long legs and a long beak, and which eats fish.",
    "herring": "A herring is a long silver-coloured fish. Herring live in large groups in the sea.",
    "horse": "A horse is a large animal which people can ride. Some horses are used for pulling ploughs and carts.",
    "hound": "A hound is a type of dog that is often used for hunting or racing.",
    "hummingbird": "A hummingbird is a small brightly coloured bird found in America, especially Central and South America. It has a long thin beak and powerful narrow wings that can move very fast.",
    "hyena": "A hyena is an animal that looks rather like a dog and makes a sound which is similar to a human laugh. Hyenas live in Africa and Asia.",
    "jaguar": "A jaguar is a large animal of the cat family with dark spots on its back.",
    "jay": "In Europe and Asia, a jay is a brownish-pink bird with blue and black wings.",
    "junco": "any North American bunting of the genus Junco, having a greyish plumage with white outer tail feathers",
    "killer whale": "A killer whale is a type of black and white whale.",
    "king cobra": "Also called : hamadryad a very large venomous tropical Asian elapid snake, Ophiophagus hannah, that feeds on snakes and other reptiles and extends its neck into a hood when alarmed",
    "kiwi": "A kiwi is the same as a kiwi fruit.",
    "kookaburra": "a large arboreal Australian kingfisher, Dacelo novaeguineae (or gigas), with a cackling cry",
    "lemon shark": "A shark, ''Negaprion brevirostris'', growing up to 10 feet long and found along the Atlantic coast of North AmericaNorth and South America.",
    "lemur": "A lemur is an animal that looks like a small monkey and has a long tail and a face similar to that of a fox.",
    "leopard": "A leopard is a type of large, wild cat. Leopards have yellow fur and black spots, and live in Africa and Asia.",
    "lion": "A lion is a large wild member of the cat family that is found in Africa. Lions have yellowish fur, and male lions have long hair on their head and neck.",
    "lizard": "A lizard is a reptile with short legs and a long tail.",
    "llama": "A llama is a South American animal with thick hair, which looks like a small camel without a hump.",
    "loach": "any carplike freshwater cyprinoid fish of the family Cobitidae, of Eurasia and Africa, having a long narrow body with barbels around the mouth",
    "lorikeet": "any of various small lories, such as Glossopsitta versicolor (varied lorikeet) or Trichoglossus moluccanus (rainbow lorikeet)",
    "lynx": "A lynx is a wild animal similar to a large cat.",
    "macaw": "any large tropical American parrot of the genera Ara and Anodorhynchus, having a long tail and brilliant plumage",
    "mackerel": "A mackerel is a sea fish with a dark, patterned back.",
    "mako shark": "Either of two powerful mackerel sharks of the genus ''Isurus'', having a large heavy body, a sharp nose and a nearly symmetrical tail, found in southern oceans.",
    "mallard": "A mallard is a kind of wild duck which is very common.",
    "manatee": "any sirenian mammal of the genus Trichechus, occurring in tropical coastal waters of America, the Caribbean, and Africa: family Trichechidae. They resemble whales and have a prehensile upper lip and a broad flattened tail",
    "meadowlark": "either of two North American yellow-breasted songbirds, Sturnella magna (eastern meadowlark) or S. neglecta (western meadowlark): family Icteridae (American orioles)",
    "meerkat": "any of several South African mongooses, esp Suricata suricatta (slender-tailed meerkat or suricate), which has a lemur-like face and four-toed feet",
    "mink": "A mink is a small animal with highly valued fur.",
    "minnow": "A minnow is a very small fish that lives in lakes and rivers.",
    "mole": "A mole is a natural dark spot or small dark lump on someone's skin.",
    "mongoose": "any small predatory viverrine mammal of the genus Herpestes and related genera, occurring in Africa and from S Europe to SE Asia, typically having a long tail and brindled coat",
    "monkey": "A monkey is an animal with a long tail which lives in hot countries and climbs trees.",
    "moose": "A moose is a large type of deer. Moose have big flat horns called antlers and are found in Northern Europe, Asia, and North America. Some British speakers use moose to refer to the North American variety of this animal, and elk to refer to the European and Asian varieties.",
    "nightingale": "A nightingale is a small brown bird. The male, which can be heard at night, sings beautifully.",
    "ocelot": "a feline mammal, Felis pardalis, inhabiting the forests of Central and South America and having a dark-spotted buff-brown coat",
    "onager": "a Persian variety of the wild ass, Equus hemionus Compare kiang",
    "oriole": "any songbird of the mainly tropical Old World family Oriolidae, such as Oriolus oriolus (golden oriole), having a long pointed bill and a mostly ye...",
    "ostrich": "An ostrich is a very large African bird that cannot fly.",
    "otter": "An otter is a small animal with brown fur, short legs, and a long tail. Otters swim well and eat fish.",
    "owl": "An owl is a bird with a flat face, large eyes, and a small sharp beak. Most owls obtain their food by hunting small animals at night.",
    "panda": "A panda or a giant panda is a large animal rather like a bear, which has black and white fur and lives in the bamboo forests of China.",
    "pangolin": "Also called : scaly anteater any mammal of the order Pholidota found in tropical Africa, S Asia, and Indonesia, having a body covered with overlapping horny scales and a long snout specialized for feeding on ants and termites",
    "panther": "A panther is a large wild animal that belongs to the cat family. Panthers are usually black.",
    "parakeet": "A parakeet is a type of small parrot which is brightly coloured and has a long tail.",
    "peacock": "A peacock is a large bird. The male has a very large tail covered with blue and green spots, which it can spread out like a fan.",
    "peccary": "either of two piglike artiodactyl mammals, Tayassu tajacu (collared peccary) or T. albirostris (white-lipped peccary) of forests of southern North America, Central and South America: family Tayassuidae",
    "pelican": "A pelican is a type of large water bird. It catches fish and keeps them in the bottom part of its beak which is shaped like a large bag.",
    "pigeon": "A pigeon is a bird, usually grey in colour, which has a fat body. Pigeons often live in towns.",
    "piranha": "A piranha is a small, fierce fish which is found in South America.",
    "plover": "A plover is a bird with a rounded body, a short tail, and a short beak that is found by the sea or by lakes.",
    "polar bear": "A polar bear is a large white bear which is found near the North Pole.",
    "puffer": "a person or thing that puffs",
    "quail": "A quail is a type of small bird which is often shot and eaten.",
    "rabbit": "A rabbit is a small furry animal with long ears. Rabbits are sometimes kept as pets, or live wild in holes in the ground.",
    "raccoon": "A raccoon is a small animal that has dark-coloured fur with white stripes on its face and on its long tail. Raccoons live in forests in North and Central America and the West Indies.",
    "ray": "Rays of light are narrow beams of light.",
    "red panda": "an omnivorous mammal, ''Ailurus fulgens'', native to the Himalayas and eastern Asia, which has dark red fur and a ringed tail",
    "reindeer": "A reindeer is a deer with large horns called antlers that lives in northern areas of Europe, Asia, and America.",
    "rhea": "either of two large fast-running flightless birds, Rhea americana or Pterocnemia pennata, inhabiting the open plains of S South America: order Rheiformes. They are similar to but smaller than the ostrich, having three-toed feet and a completely feathered body See ratite",
    "rhinoceros": "A rhinoceros is a large Asian or African animal with thick grey skin and a horn, or two horns, on its nose.",
    "robin": "A robin is a small brown bird found in Europe. The male has an orangey-red neck and breast.",
    "rooster": "A rooster is an adult male chicken.",
    "sailfish": "any of several large scombroid game fishes of the genus Istiophorus, such as I. albicans (Atlantic sailfish), of warm and tropical seas: family Ist...",
    "salamander": "A salamander is an animal that looks rather like a lizard, and that can live both on land and in water.",
    "salmon": "A salmon is a large silver-coloured fish.",
    "sand lance": "another name for the sand eel",
    "sea horse": "any marine teleost fish of the temperate and tropical genus Hippocampus, having a bony-plated body, a prehensile tail, and a horselike head and swi...",
    "sea lion": "A sea lion is a type of large seal.",
    "sea otter": "a large marine otter, Enhydra lutris, of N Pacific coasts, formerly hunted for its thick dark brown fur",
    "sea turtle": "A sea turtle is a large reptile which has a thick shell covering its body and which lives in the sea most of the time.",
    "shark": "A shark is a very large fish. Some sharks have very sharp teeth and may attack people.",
    "sheep": "A sheep is a farm animal which is covered with thick curly hair called wool. Sheep are kept for their wool or for their meat.",
    "shrew": "A shrew is a small brown animal like a mouse with a long pointed nose.",
    "skunk": "A skunk is a small black and white animal which releases an unpleasant smelling liquid if it is frightened or attacked. Skunks live in America.",
    "sloth": "Sloth is laziness, especially with regard to work.",
    "snailfish": "another name for sea snail",
    "snake": "A snake is a long, thin reptile without legs.",
    "snow leopard": "Also called : ounce a large feline mammal, Panthera uncia, of mountainous regions of central Asia, closely related to the leopard but having a long pale brown coat marked with black rosettes",
    "softshell turtle": "Any turtle of the family Trionychidae, such turtles having a carapace that has no scutes and is leathery and pliable at the sides.",
    "sparrow": "A sparrow is a small brown bird that is very common in Britain.",
    "sperm whale": "A sperm whale is a large whale with a large head that has a section in it which contains oil.",
    "starling": "A starling is a very common bird with greenish-black feathers covered in pale spots which is found in Europe and North America. Starlings often fly around in large groups.",
    "sunfish": "any large plectognath fish of the family Molidae, of temperate and tropical seas, esp Mola mola, which has a large rounded compressed body, long po...",
    "swan": "A swan is a large bird with a very long neck. Swans live on rivers and lakes and are usually white.",
    "swift": "A swift event or process happens very quickly or without delay.",
    "swordfish": "A swordfish is a large sea fish with a very long upper jaw.",
    "tiger": "A tiger is a large fierce animal belonging to the cat family. Tigers are orange with black stripes.",
    "toad": "A toad is a creature which is similar to a frog but which has a drier skin and spends less time in water.",
    "tortoise": "A tortoise is a slow-moving animal with a shell into which it can pull its head and legs for protection.",
    "trout": "A trout is a fairly large fish that lives in rivers and streams.",
    "tuna": "Tuna or tuna fish are large fish that live in warm seas and are caught for food.",
    "turkey": "A turkey is a large bird that is kept on a farm for its meat.",
    "turtle": "A turtle is a large reptile which has a thick shell covering its body and which lives in the sea most of the time.",
    "vampire bat": "A vampire bat is a bat from South America which feeds by sucking the blood of other animals.",
    "vulture": "A vulture is a large bird which lives in hot countries and eats the flesh of dead animals.",
    "walrus": "A walrus is a large, fat animal which lives in the sea. It has two long teeth called tusks that point downwards.",
    "warthog": "A warthog is a wild pig with two large teeth that curve upwards at the sides of its mouth. Warthogs live in Africa.",
    "weasel": "A weasel is a small wild animal with a long thin body, a tail, short legs, and reddish-brown fur.",
    "whale": "Whales are very large mammals that live in the sea.",
    "whale shark": "a large spotted whalelike shark, Rhincodon typus, of warm seas, that feeds on plankton and small animals: family Rhincodontidae",
    "white shark": "The great white shark",
    "wolf": "A wolf is a wild animal that looks like a large dog.",
    "wood duck": "a duck, Aix sponsa, of wooded swamps, lakes, etc, in North America, having a very brightly coloured plumage in the male",
    "wood owl": "another name for tawny owl",
    "woodpecker": "A woodpecker is a type of bird with a long sharp beak. Woodpeckers use their beaks to make holes in tree trunks.",
    "yak": "A yak is a type of cattle that has long hair and long horns. Yaks live mainly in the Himalayan mountains and in Tibet.",
    "zebra": "A zebra is an African wild horse which has black and white stripes."
}