{
    "French fries": "French fries are long, thin pieces of potato fried in oil or fat.",
    "almond": "Almonds are pale oval nuts. They are often used in cooking.",
    "anchovy": "Anchovies are small fish that live in the sea. They are often eaten salted.",
    "apple": "An apple is a round fruit with smooth green, yellow, or red skin and firm white flesh.",
    "apricot": "An apricot is a small, soft, round fruit with yellowish-orange flesh and a stone inside.",
    "asparagus": "Asparagus is a vegetable that is long and green and has small shoots at one end. It is cooked and served whole.",
    "avocado": "Avocados are pear-shaped vegetables, with hard skins and large stones, which are usually eaten raw.",
    "bacon": "Bacon is salted or smoked meat which comes from the back or sides of a pig.",
    "bagel": "A bagel is a ring-shaped bread roll.",
    "banana": "Bananas are long curved fruit with yellow skins.",
    "barbecue": "A barbecue is a piece of equipment which you use for cooking on in the open air.",
    "barley": "Barley is a grain that is used to make food, beer, and whisky.",
    "basil": "Basil is a strong-smelling and strong-tasting herb that is used in cooking, especially with tomatoes.",
    "beef": "Beef is the meat of a cow, bull, or ox.",
    "berry": "Berries are small, round fruit that grow on a bush or a tree. Some berries are edible, for example blackberries and raspberries.",
    "biscuit": "A biscuit is a small flat cake that is crisp and usually sweet.",
    "blackberry": "A blackberry is a small, soft black or dark purple fruit.",
    "blueberry": "A blueberry is a small dark blue fruit that is found in North America. Blueberries are usually cooked before they are eaten.",
    "bread": "Bread is a very common food made from flour, water, and yeast.",
    "brisket": "Brisket is a cut of beef that comes from the breast of the cow.",
    "broccoli": "Broccoli is a vegetable with green stalks and green or purple tops.",
    "brownie": "Brownies are small flat biscuits or cakes. They are usually chocolate flavoured and have nuts in them.",
    "buckwheat": "Buckwheat is a type of small black grain used for feeding animals and making flour. Buckwheat also refers to the flour itself.",
    "burrito": "A tortilla folded over a filling of minced beef, chicken, cheese, or beans",
    "butter": "Butter is a soft yellow substance made from cream. You spread it on bread or use it in cooking.",
    "cake": "A cake is a sweet food made by baking a mixture of flour, eggs, sugar, and fat in an oven. Cakes may be large and cut into slices or small and i...",
    "candy": "Candy is sweet foods such as toffees or chocolate.",
    "caramel": "A caramel is a chewy sweet food made from sugar, butter, and milk.",
    "caramel apple": "A dessert or snack made by dipping an apple in liquid heated caramel and often sprinkling with nuts etc., then allowing the caramel to cool and harden.",
    "carrot": "Carrots are long, thin, orange-coloured vegetables. They grow under the ground, and have green shoots above the ground.",
    "celery": "Celery is a vegetable with long pale green stalks. It is eaten raw in salads.",
    "cereal": "Cereal or breakfast cereal is a food made from grain. It is mixed with milk and eaten for breakfast.",
    "cheddar": "Cheddar is a type of hard yellow cheese, originally made in Britain.",
    "cheese": "Cheese is a solid food made from milk. It is usually white or yellow.",
    "cheesecake": "Cheesecake is a dessert that consists of a base made from broken biscuits covered with a soft sweet mixture containing cream cheese.",
    "cherry": "Cherries are small, round fruit with red skins.",
    "chicken": "Chickens are birds which are kept on a farm for their eggs and for their meat.",
    "chili": "see chilli",
    "chips": "Traditional nickname for someone whose surname is Carpenter.",
    "chocolate": "Chocolate is a sweet hard food made from cocoa beans. It is usually brown in colour and is eaten as a sweet.",
    "cilantro": "Also called (in Britain and certain other countries) : coriander a European umbelliferous plant, Coriandrum sativum, widely cultivated for its aromatic seeds and leaves, used in flavouring food, etc",
    "cinnamon": "Cinnamon is a sweet spice used for flavouring food.",
    "citron": "a small Asian rutaceous tree, Citrus medica, having lemon-like fruit with a thick aromatic rind See also citron wood",
    "citrus": "A citrus fruit is a juicy fruit with a sharp taste such as an orange, lemon, or grapefruit.",
    "coconut": "A coconut is a very large nut with a hairy shell, which has white flesh and milky juice inside it.",
    "coffee": "Coffee is a hot drink made with water and ground or powdered coffee beans.",
    "cookie": "A cookie is a sweet biscuit.",
    "corn": "Corn is used to refer to crops such as wheat and barley. It can also be used to refer to the seeds from these plants.",
    "cornflakes": "a breakfast cereal made from toasted maize, eaten with milk, sugar, etc",
    "crab": "A crab is a sea creature with a flat round body covered by a shell, and five pairs of legs with large claws on the front pair. Crabs usually move sideways.",
    "cranberry": "Cranberries are red berries with a sour taste. They are often used to make a sauce or jelly that you eat with meat.",
    "cream": "Cream is a thick yellowish-white liquid taken from milk. You can use it in cooking or put it on fruit or desserts.",
    "cream cheese": "Cream cheese is a very rich, soft white cheese.",
    "crepe": "Crepe is a thin fabric with an uneven surface and is made of cotton, silk, or wool.",
    "cucumber": "A cucumber is a long thin vegetable with a hard green skin and wet transparent flesh. It is eaten raw in salads.",
    "cupcake": "Cupcakes are small iced cakes for one person.",
    "curry": "Curry is a dish composed of meat and vegetables, or just vegetables, in a sauce containing hot spices. It is usually eaten with rice an...",
    "doughnut": "A doughnut is a bread-like cake made from sweet dough that has been cooked in hot fat.",
    "dragonfruit": "another name for pitahaya",
    "durian": "Asian bombacaceous tree, Durio zibethinus, having very large oval fruits with a hard spiny rind containing seeds surrounded by edible evil-sme...",
    "egg": "An egg is an oval object that is produced by a female bird and which contains a baby bird. Other animals such as reptiles and fish also lay eggs...",
    "fish": "A fish is a creature that lives in water and has a tail and fins. There are many different kinds of fish.",
    "garlic": "Garlic is the small, white, round bulb of a plant that is related to the onion plant. Garlic has a very strong smell and taste and is used in cooking.",
    "gelatin": "Gelatine is a clear tasteless powder that is used to make liquids become firm, for example when you are making desserts such as jelly.",
    "ginger": "Ginger is the root of a plant that is used to flavour food. It has a sweet spicy flavour and is often sold in powdered form.",
    "ginger ale": "Ginger ale is a fizzy non-alcoholic drink flavoured with ginger, which is often mixed with an alcoholic drink.",
    "gingerbread": "Gingerbread is a sweet biscuit or cookie that is flavoured with ginger. It is often made in the shape of a man or an animal.",
    "granola": "A mixture of rolled oats, brown sugar, nuts, fruit, etc, eaten with milk",
    "grape": "Grapes are small green or dark purple fruit which grow in bunches. Grapes can be eaten raw, used for making wine, or dried.",
    "grapefruit": "A grapefruit is a large, round, yellow fruit, similar to an orange, that has a sharp, slightly bitter taste.",
    "green bean": "Green beans are long narrow beans that are eaten as a vegetable.",
    "green tea": "a sharp tea made from tea leaves that have been steamed and dried quickly without fermenting",
    "guacamole": "Guacamole is a cold food from Mexico made of crushed avocados and other ingredients such as tomatoes and chillis.",
    "guava": "A guava is a round yellow tropical fruit with pink or white flesh and hard seeds.",
    "ham": "Ham is meat from the top of the back leg of a pig, specially treated so that it can be kept for a long period of time.",
    "hamburger": "A hamburger is minced meat which has been shaped into a flat circle. Hamburgers are fried or grilled and then eaten, often in a bread roll.",
    "hazelnut": "Hazelnuts are nuts from a hazel tree, which can be eaten.",
    "honey": "Honey is a sweet, sticky, yellowish substance that is made by bees.",
    "hot dog": "A hot dog is a long bread roll with a hot sausage inside it.",
    "hot sauce": "Any liquid spicy condiment or cooking ingredient made from chile peppers.",
    "ice": "Ice is frozen water.",
    "ice cream": "Ice cream is a very cold sweet food which is made from frozen cream or a substance like cream and has a flavour such as vanilla, chocolate, or s...",
    "jam": "Jam is a thick sweet food that is made by cooking fruit with a large amount of sugar, and that is usually spread on brea...",
    "jelly": "Jelly is a transparent, usually coloured food that is eaten as a dessert. It is made from gelatine, fruit juice, and sugar.",
    "kebab": "A kebab is pieces of meat or vegetables grilled on a long thin stick, or slices of grilled meat served in pitta bread.",
    "ketchup": "Ketchup is a thick, cold sauce, usually made from tomatoes, that is sold in bottles.",
    "kiwi": "A kiwi is the same as a kiwi fruit.",
    "lemon": "A lemon is a bright yellow fruit with very sour juice. Lemons grow on trees in warm countries.",
    "lemonade": "Lemonade is a colourless sweet fizzy drink. A drink that is made from lemons, sugar, and water and is not fizzy can also be referred to as lemonade.",
    "lettuce": "A lettuce is a plant with large green leaves that is the basic ingredient of many salads.",
    "licorice": "Licorice is a firm black substance with a strong taste. It is used for making sweets.",
    "lime": "A lime is a green fruit that tastes like a lemon. Limes grow on trees in tropical countries.",
    "lobster": "A lobster is a sea creature that has a hard shell, two large claws, and eight legs.",
    "lollipop": "A lollipop is a sweet consisting of a hard disc or ball of a sugary substance on the end of a stick.",
    "macaroni": "Macaroni is a kind of pasta made in the shape of short hollow tubes.",
    "macaroon": "Macaroons are sweet cake-like biscuits that are flavoured with coconut or almond.",
    "mango": "A mango is a large sweet yellowish fruit which grows on a tree in hot countries.",
    "maple syrup": "Maple syrup is a sweet, sticky, brown liquid made from the sap of maple trees, that can be eaten with pancakes or used to make desserts.",
    "margarine": "Margarine is a yellow substance made from vegetable oil and animal fats that is similar to butter. You spread it on bread or use it for cooking.",
    "marmalade": "Marmalade is a food made from oranges, lemons, or grapefruit that is similar to jam. It is eaten on bread or toast at breakfast.",
    "marshmallow": "Marshmallow is a soft, sweet food that is used in some cakes, puddings, and sweets.",
    "mayonnaise": "Mayonnaise is a thick pale sauce made from egg yolks and oil. It is put on salad.",
    "meat": "Meat is flesh taken from a dead animal that people cook and eat.",
    "meatball": "Meatballs are small balls of chopped meat. They are usually eaten with a sauce.",
    "melon": "A melon is a large fruit which is sweet and juicy inside and has a hard green or yellow skin.",
    "meringue": "Meringue is a mixture of beaten egg whites and sugar which is baked in the oven.",
    "milk": "Milk is the white liquid produced by cows, goats, and some other animals, which people drink and use to make butter, cheese, and yoghurt.",
    "milkshake": "A milkshake is a cold drink made by mixing milk with a flavouring or fruit, and sometimes ice cream.",
    "mint": "Mint is a herb with fresh-tasting leaves.",
    "mozzarella": "a moist white Italian curd cheese made originally from buffalo milk",
    "muffin": "Muffins are small, round, sweet cakes, usually with fruit or bran inside. They are often eaten with butter for breakfast.",
    "mushroom": "Mushrooms are fungi that you can eat.",
    "mustard": "Mustard is a yellow or brown paste usually eaten with meat. It tastes hot and spicy.",
    "nut": "The firm shelled fruit of some trees and bushes are called nuts. Some nuts can be eaten.",
    "oatmeal": "Oatmeal is a kind of flour made by crushing oats.",
    "olive": "Olives are small green or black fruit with a bitter taste. Olives are often pressed to make olive oil.",
    "omelet": "Alternative form of omelette",
    "onion": "An onion is a round vegetable with a brown skin that grows underground. It has many white layers on its inside which have a strong, sharp smell and taste.",
    "orange": "Something that is orange is of a colour between red and yellow.",
    "oyster": "An oyster is a large flat shellfish. Some oysters can be eaten and others produce valuable objects called pearls.",
    "pancake": "A pancake is a thin, flat, circular piece of cooked batter made from milk, flour, and eggs. Pancakes are often rolled up or folded and eaten hot with a sweet or savoury filling inside. In America, pancakes are usually eaten for breakfast, with butter and maple syrup.",
    "papaya": "A papaya is a fruit with a green skin, sweet yellow flesh, and small black seeds. Papayas grow on trees in hot countries such as the West Indies.",
    "parsley": "Parsley is a small plant with curly leaves that are used for flavouring or decorating savoury food.",
    "pasta": "Pasta is a type of food made from a mixture of flour, eggs, and water that is formed into different shapes and then boiled. Spaghetti, macaroni, and noodles are types of pasta.",
    "pea": "Peas are round green seeds which grow in long thin cases and are eaten as a vegetable.",
    "peach": "A peach is a soft, round, slightly furry fruit with sweet yellow flesh and pinky-orange skin. Peaches grow in warm countries.",
    "peanut": "Peanuts are small nuts that grow under the ground. Peanuts are often eaten as a snack, especially roasted and salted.",
    "peanut butter": "Peanut butter is a brown paste made out of crushed peanuts which you can spread on bread and eat.",
    "pepper": "Pepper is a hot-tasting spice which is used to flavour food.",
    "pepperoni": "Pepperoni is a kind of spicy sausage which is often sliced and put on pizzas.",
    "pickle": "Pickles are vegetables or fruit, sometimes cut into pieces, which have been kept in vinegar or salt water for a long time so that they have a st...",
    "pie": "A pie consists of meat, vegetables, or fruit baked in pastry.",
    "pineapple": "A pineapple is a large oval fruit that grows in hot countries. It is sweet, juicy, and yellow inside. It has a thick brownish skin.",
    "pizza": "A pizza is a flat, round piece of dough covered with tomatoes, cheese, and other savoury food, and then baked in an oven.",
    "plum": "A plum is a small, sweet fruit with a smooth red or yellow skin and a stone in the middle.",
    "pomegranate": "A pomegranate is a round fruit with a thick reddish skin. It contains lots of small seeds with juicy flesh around them.",
    "popcorn": "Popcorn is a snack which consists of grains of maize or corn that have been heated until they have burst and become large and light. It can be eaten with salt or sometimes sugar.",
    "popsicle": "A Popsicle is a piece of flavoured ice or ice cream on a stick.",
    "pork": "Pork is meat from a pig, usually fresh and not smoked or salted.",
    "potato": "Potatoes are quite round vegetables with brown or red skins and white insides. They grow under the ground.",
    "pretzel": "A pretzel is a small, crisp, shiny biscuit, which has salt on the outside. Pretzels are usually shaped like knots or sticks.",
    "prune": "A prune is a dried plum.",
    "pumpkin": "A pumpkin is a large, round, orange vegetable with a thick skin.",
    "quinoa": "a grain high in nutrients traditionally grown as a staple food high in the Andes",
    "raisin": "Raisins are dried grapes.",
    "raspberry": "Raspberries are small, soft, red fruit that grow on bushes.",
    "rice": "Rice consists of white or brown grains taken from a cereal plant. You cook rice and usually eat it with meat or vegetables.",
    "salad": "A salad is a mixture of raw or cold foods such as lettuce, cucumber, and tomatoes. It is often served with other food as part of a meal...",
    "salami": "Salami is a type of strong-flavoured sausage. It is usually thinly sliced and eaten cold.",
    "salmon": "A salmon is a large silver-coloured fish.",
    "salsa": "Salsa is a hot, spicy sauce made from onions and tomatoes, usually eaten with Mexican or Spanish food.",
    "salt": "Salt is a strong-tasting substance, in the form of white powder or crystals, which is used to improve the flavour of food or to preserve it. Sal...",
    "sandwich": "A sandwich usually consists of two slices of bread with a layer of food such as cheese or meat between them.",
    "sauce": "A sauce is a thick liquid which is served with other food.",
    "sausage": "A sausage consists of minced meat, usually pork, mixed with other ingredients and is contained in a tube made of skin or a similar material.",
    "seaweed": "Seaweed is a plant that grows in the sea. There are many kinds of seaweed.",
    "shrimp": "Shrimps are small shellfish with long tails and many legs.",
    "soda": "Soda is the same as soda water.",
    "soup": "Soup is liquid food made by boiling meat, fish, or vegetables in water.",
    "soy": "Soy flour, butter, or other food is made from soybeans.",
    "spaghetti": "Spaghetti is a type of pasta. It looks like long pieces of string and is usually served with a sauce.",
    "spinach": "Spinach is a vegetable with large dark green leaves that you chop up and boil in water before eating.",
    "squid": "A squid is a sea creature with a long soft body and many soft arms called tentacles.",
    "steak": "A steak is a large flat piece of beef without much fat on it. You cook it by grilling or frying it.",
    "stew": "A stew is a meal which you make by cooking meat and vegetables in liquid at a low temperature.",
    "strawberry": "A strawberry is a small red fruit which is soft and juicy and has tiny yellow seeds on its skin.",
    "sugar": "Sugar is a sweet substance that is used to make food and drinks sweet. It is usually in the form of small white or brown crystals.",
    "sundae": "A sundae is a tall glass of ice cream with whipped cream and nuts or fruit on top.",
    "sushi": "Sushi is a Japanese dish of rice with sweet vinegar, often served with raw fish.",
    "sweet potato": "Sweet potatoes are vegetables that look like large ordinary potatoes but taste sweet. They have pinkish-brown skins and yellow flesh.",
    "syrup": "Syrup is a sweet liquid made by cooking sugar with water, and sometimes with fruit juice as well.",
    "taco": "A taco is a crispy Mexican pancake made from corn and eggs, which is folded and filled with meat, vegetables, and a spicy sauce.",
    "tangerine": "A tangerine is a small sweet orange.",
    "teriyaki": "basted with soy sauce and rice wine and broiled over an open fire",
    "toast": "Toast is bread which has been cut into slices and made brown and crisp by cooking at a high temperature.",
    "tofu": "unfermented soya-bean curd, a food with a soft cheeselike consistency made from soya-bean milk",
    "tomato": "Tomatoes are small, soft, red fruit that you can eat raw in salads or cooked as a vegetable.",
    "tortilla": "A tortilla is a piece of thin flat bread that first came from Mexico, and is made from corn and eggs.",
    "tuna": "Tuna or tuna fish are large fish that live in warm seas and are caught for food.",
    "vanilla": "Vanilla is a flavouring used in ice cream and other sweet food.",
    "vinegar": "Vinegar is a sharp-tasting liquid, usually made from sour wine or malt, which is used to make things such as salad dressing.",
    "wafer": "A wafer is a thin crisp biscuit which is usually eaten with ice cream.",
    "waffle": "If you say that someone waffles, you are critical of them because they talk or write a lot without actually makin...",
    "wasabi": "a Japanese cruciferous plant, Eutrema Wasabi, cultivated for its thick green pungent root",
    "water": "Water is a clear thin liquid that has no colour or taste when it is pure. It falls from clouds as rain and enters rivers and seas. All animals a...",
    "watermelon": "A watermelon is a large round fruit with green skin, pink flesh, and black seeds.",
    "wheat": "Wheat is a cereal crop grown for food. Wheat is also used to refer to the grain of this crop, which is usually ground into flour and used to make bread.",
    "yogurt": "Yogurt is a food in the form of a thick, slightly sour liquid that is made by adding bacteria to milk. A yogurt is a small pot of yogurt."
}