{
    "Afghanistan": "a republic in central Asia: became independent in 1919; occupied by Soviet troops, 1979--89; controlled by mujaheddin forces from 1992 until 1996 when Taliban forces seized power; in the US-led `war on terror' (2001) the Taliban were overthrown and replaced by an interim administration, ...",
    "Algeria": "A republic in NW Africa, on the Mediterranean: became independent in 1962, after more than a century of French rule; one-party constitution adopted in 1976; religious extremists led a campaign of violence from 1988 until 2000; consists chiefly of the N Sa...",
    "Angola": "a republic in SW Africa, on the Atlantic: includes the enclave of Cabinda, north of the River Congo; a Portuguese possession from 1575 until its independence in 1975; multiparty constitution adopted in 1991; factional violence. It consists of a narrow coastal plain with a large fertile p...",
    "Argentina": "Also called : the Argentine a republic in southern South America: colonized by the Spanish from 1516 onwards; gained independence in 1816 and became a republic in 1852; ruled by military dictatorships for much of the 20th century; civilian rule restored in 1983; consists chiefly of subtr...",
    "Australia": "a country and the smallest continent, situated between the Indian Ocean and the Pacific: a former British colony, now an independent member of the Commonwealth, constitutional links with Britain formally abolished in 1986; consists chiefly of a low plateau, mostly arid in the west, with ...",
    "Austria": "A republic in central Europe: ruled by the Hapsburgs from 1282 to 1918; formed a dual monarchy with Hungary in 1867 and became a republic in 1919; a member of the European Union; contains part of the Alps, the Danube basin in the east, and extensive forests. Off...",
    "Azerbaijan": "a republic in NW Asia: the region was acquired by Russia from Persia in the early 19th century; became the Azerbaijan Soviet Socialist Republic in ...",
    "Bangladesh": "a republic in S Asia: formerly the Eastern Province of Pakistan, became independent in 1971 after civil war and the defeat of Pakistan by India, consists of the plains and vast deltas of the Ganges and Brahmaputra Rivers, prone to flooding: economy based on jute and jute products (over 7...",
    "Belarus": "a republic in E Europe, part of the medieval Lithuanian and Polish empires before being occupied by Russia, a Soviet republic (1919--91), in 1997 formed a close political and economic union with Russia: mainly low-lying and forested. Languages: Belarussian, Russian. Religion: believers a...",
    "Belgium": "a federal kingdom in NW Europe: at various times under the rulers of Burgundy, Spain, Austria, France, and the Netherlands before becoming an independent kingdom in 1830. It formed the Benelux customs union with the Netherlands and Luxembourg in 1948 and and was a founder member of the C...",
    "Benin": "Former name (until 1975) : Dahomey a republic in W Africa, on the Bight of Benin, a section of the Gulf of Guinea: in the early 19th century a powe...",
    "Bolivia": "an inland republic in central S America: Indian population conquered by the Incas in the 13th century; colonized by Spain from 1538; became a republic in 1825; consists of low plains in the east, with ranges of the Andes rising to over ...",
    "Brazil": "a republic in South America, comprising about half the area and half the population of South America: colonized by the Portuguese from 1500 onwards; became independent in 1822 and a republic in 1889; consists chiefly of the tropical Amazon basin in the north, semiarid scrub in the northe...",
    "Bulgaria": "a republic in SE Europe, on the Balkan Peninsula on the Black Sea: under Turkish rule from 1395 until 1878; became an independent kingdom in 1908 and a republic in 1946; joined the EU in 2007; consists chiefly of the Danube valley in the north and the Balkan Mountains in the central part...",
    "Burkina Faso": "Former name (until 1984) : Upper Volta an inland republic in W Africa: dominated by Mossi kingdoms (10th--19th centuries); French protectorate established in 1896; became an independent republic in 1960; consists mainly of a flat savanna plateau. Official language: French; Mossi and othe...",
    "Burundi": "Former name (until 1962) : Urundi a republic in E central Africa: inhabited chiefly by the Hutu, Tutsi, and Twa (Pygmy); made part of German East Africa in 1899; part of the Belgian territory of Ruanda-Urundi from 1923 until it became independent in 1962; ethnic violence has erupted at t...",
    "Cambodia": "a country in SE Asia: became part of French Indochina in 1887; achieved self-government in 1949 and independence in 1953; civil war (1970--74) ended in victory for the Khmer Rouge, who renamed the country Kampuchea (1975) and carried out extreme-radical political and economic reforms res...",
    "Cameroon": "a republic in West Africa, on the Gulf of Guinea: became a German colony in 1884; divided in 1919 into the Cameroons (administered by Britain) and ...",
    "Canada": "a country in North America: the second largest country in the world; first permanent settlements by Europeans were made by the French from 1605; ceded to Britain in 1763 after a series of colonial wars; established as the Dominion of Canada in 1867; a member of the Commonwealth. It consi...",
    "Central African Republic": "a landlocked country of central Africa: joined with Chad as a territory of French Equatorial Africa in 1910; became an independent republic in 1960; a parliamentary monarchy (1976--79); consists of a huge plateau, mostly savanna, with dense forests in the south; drained chiefly by the Sh...",
    "Chad": "French name : Tchad a republic in N central Africa: made a territory of French Equatorial Africa in 1910; became independent in 1960; contains much...",
    "Chile": "a republic in South America, on the Pacific, with a total length of about 4090 km (2650 miles) and an average width of only 177 km (110 miles): gained independence from Spain in 1818; the government of President Allende (elected 1970) attempted the implementation of Marxist policies with...",
    "China": "China is a hard white substance made from clay. It is used to make things such as cups, bowls, plates, and ornaments.",
    "Colombia": "a republic in NW South America: inhabited by Chibchas and other Indians before Spanish colonization in the 16th century; independence won by Bolivar in 1819; became the Republic of Colombia in 1886; violence and unrest have been endemic since the 1970s. It consists chiefly of a hot swam...",
    "Congo": "Democratic Republic of Congo a republic in S central Africa, with a narrow strip of land along the Congo estuary leading to the Atlantic in the wes...",
    "Costa Rica": "a republic in Central America: gained independence from Spain in 1821; mostly mountainous and volcanic, with extensive forests. Official language: Spanish. Official religion: Roman Catholic. ",
    "Croatia": "a republic in SE Europe: settled by Croats in the 7th century; belonged successively to Hungary, Turkey, and Austria; formed part of Yugoslavia (1918--91); became independent in 1991 but was invaded by Serbia and fighting continued until 1995; involved in the civ...",
    "Cuba": "a republic and the largest island in the Caribbean, at the entrance to the Gulf of Mexico: became a Spanish colony after its discovery by Columbus in 1492; gained independence after the Spanish-American War of 1898 but remained subject to US influence until declared a people's republic u...",
    "Czechia": "The Czech Republic nation in Europe.",
    "Democratic Republic of the Congo": "A large central African nation, formerly called Zaire, whose capital is Kinshasa.",
    "Denmark": "Danmark a kingdom in N Europe, between the Baltic and the North Sea: consists of the mainland of Jutland and about 100 inhabited islands (chiefly Zealand, Lolland, Funen, Falster, Langeland, and Bornholm); extended its territory throughout the Middle Ages, ruling Sweden unt...",
    "Dominican Republic": "Former name (until 1844) : Santo Domingo a republic in the Caribbean, occupying the eastern half of the island of Hispaniola: colonized by the Spanish after its discovery by Columbus in 1492; gained independence from Spain in 1821. It is generally mountainous, dominated by the Cordillera...",
    "Ecuador": "a republic in South America, on the Pacific: under the Incas when Spanish colonization began in 1532; gained independence in 1822; declared a republic in 1830. It consists chiefly of a coastal plain in the west, separated from the densely forested upper Amazon basin (Oriente) by ranges a...",
    "Egypt": "a republic in NE Africa, on the Mediterranean and Red Sea: its history dates back about 5000 years. Occupied by the British from 1882, it became an independent kingdom in 1922 and a republic in 1953. Over 96 per cent of the total area is desert, with the chief areas of habitation and cul...",
    "El Salvador": "a republic in Central America, on the Pacific: colonized by the Spanish from 1524; declared independence in 1841, becoming a republic in 1856. It consists of coastal lowlands rising to a central plateau. Coffee constitutes over a third of the total exports. Official language: Spanish. Re...",
    "Ethiopia": "Former name : Abyssinia a state in NE Africa, on the Red Sea: consolidated as an empire under Menelik II (1889--1913); federated with Eritrea from 1952 until 1993; Emperor Haile Selassie was deposed by the military in 1974 and the monarchy was abolished in 1975; an independence movement ...",
    "Finland": "Finnish name : Suomi a republic in N Europe, on the Baltic Sea: ceded to Russia by Sweden in 1809; gained independence in 1917; Soviet invasion suc...",
    "France": "a republic in W Europe, between the English Channel, the Mediterranean, and the Atlantic: the largest country wholly in Europe; became a republic in 1793 after the French Revolution and an empire in 1804 under Napoleon; reverted to a monarchy (1815--48), followed by the Second Republic (...",
    "Germany": "a country in central Europe: in the Middle Ages the centre of the Holy Roman Empire; dissolved into numerous principalities; united under the leadership of Prussia in 1871 after the Franco-Prussian War; became a republic with reduced size in 1919 after being defeated in World War I; unde...",
    "Ghana": "a republic in W Africa, on the Gulf of Guinea: a powerful empire from the 4th to the 13th centuries; a major source of gold and slaves for Europeans after 1471; British colony of the Gold Coast established in 1874; united with British Togoland in 1957 and became a republic and a member o...",
    "Greece": "a republic in SE Europe, occupying the S part of the Balkan Peninsula and many islands in the Ionian and Aegean Seas; site of two of Europe's earliest civilizations (the Minoan and Mycenaean); in the classical era divided into many small independent city-states...",
    "Guatemala": "a republic in Central America: original Maya Indians conquered by the Spanish in 1523; became the centre of Spanish administration in Central America; gained independence and was annexed to Mexico in 1821, becoming an independent republic in 1839. Official language: Spanish. Religion: Ro...",
    "Guinea": "A guinea is an old British unit of money that was worth 1.05. Guineas are still sometimes used, for example in auctions.",
    "Haiti": "a republic occupying the W part of the island of Hispaniola in the Caribbean, the E part consisting of the Dominican Republic: ceded by Spain to Fr...",
    "Honduras": "a republic in Central America: an early centre of Mayan civilization, colonized by the Spanish from 1524 onwards, gained independence in 1821. Offi...",
    "Hungary": "a republic in central Europe: Magyars first unified under Saint Stephen, the first Hungarian king (1001--38); taken by the Hapsburgs from the Turks at the end of the 17th century; gained autonomy with the establishment of the dual monarchy of Austria-Hungar...",
    "India": "Hindi name : Bharat a republic in S Asia: history dates from the Indus Valley civilization (3rd millennium bc); came under British supremacy in 176...",
    "Indonesia": "a republic in SE Asia, in the Malay Archipelago, consisting of the main islands of Sumatra, Java and Madura, Bali, Sulawesi (Celebes), Lombok, Sumbawa, Flores, the Moluccas, part of Timor, part of Borneo (Kalimantan), Papua (formerly Irian Jaya), and over 3000 small islands in the Indian...",
    "Iran": "a republic in SW Asia, between the Caspian Sea and the Persian Gulf: a monarchy until an Islamic revolution in 1979 headed by the Ayatollah Khomeini when the Shah was obliged to leave the country. Consists chiefly of a high central desert plateau almost completely surrounded by mountains...",
    "Iraq": "a republic in SW Asia, on the Persian Gulf: coextensive with ancient Mesopotamia; became a British mandate in 1920, independent in 1932, and a republic in 1958. The Iraqi invasion of Kuwait (1990) led to their defeat in the first Gulf War (1991) by US-led UN forces. The second Gulf War (...",
    "Ireland": "Latin name : Hibernia an island off NW Europe: part of the British Isles, separated from Britain by the North Channel, the Irish Sea, and St George...",
    "Israel": "a republic in SW Asia, on the Mediterranean Sea: established in 1948, in the former British mandate of Palestine, as a primarily Jewish state; 8 di...",
    "Italy": "Italian name : Italia a republic in S Europe, occupying a peninsula in the Mediterranean between the Tyrrhenian and the Adriatic Seas, with the islands of Sardinia and Sicily to the west: first united under the Romans but became fragmented into numerous political units in the Middle Ages...",
    "Japan": "a glossy durable black lacquer originally from the Orient, used on wood, metal, etc",
    "Jordan": "a kingdom in SW Asia: coextensive with the biblical Moab, Gilead, and Edom; made a League of Nations mandate and emirate under British control in 1...",
    "Kazakhstan": "a republic in central Asia: conquered by Mongols in the 13th century; came under Russian control in the 18th and 19th centuries; was a Soviet republic from 1936 until it gained independence in 1991. It has rich mineral deposits and agriculture is important. Official language: Kazakh. Rel...",
    "Kenya": "a republic in E Africa, on the Indian Ocean: became a British protectorate in 1895 and a colony in 1920; gained independence in 1963 and is a membe...",
    "Kuwait": "a state on the NW coast of the Persian Gulf: came under British protection in 1899 and gained independence in 1961, invaded by Iraq in 1990, libera...",
    "Kyrgyzstan": "a republic in central Asia: came under Russian rule in the 19th century, became a Soviet republic in 1936 and gained independence in 1991; it has deposits of minerals, oil, and gas. Official languages: Kyrgyz and Russian. Religion: nonreligious, Muslim. Currency: som. Capital: Bishkek. P...",
    "Laos": "Official name : People's Democratic Republic of Laos a republic in SE Asia: first united as the kingdom of Lan Xang (\"million elephants\") in 1353, after being a province of the Khmer Empire for about four centuries; made part of French Indochina in 1893 and gained independence in 1949; b...",
    "Lebanon": "the Lebanon a republic in W Asia, on the Mediterranean: an important centre of the Phoenician civilization in the third millennium bc; part of the Ottoman Empire from 1516 until 1919; gained independence in 1941 (effective by 1945). Official language: Arabic; French and English are also ...",
    "Liberia": "a republic in W Africa, on the Atlantic: originated in 1822 as a home for freed Afro-American slaves, with land purchased by the American Colonization Society; republic declared in 1847; exports are predominantly rubber and iron ore. Official language: English. Religion: Christian majori...",
    "Libya": "Official name : Al-Jumhuria al-Arabia al-Libya ash-Shabiya al-Ishtirakiya al-Uzma a republic in N Africa, on the Mediterranean: became an Italian colony in 1912; divided after World War II into Tripolitania and Cyrenaica (under British administration) and Fezzan (under French); gained in...",
    "Madagascar": "an island republic in the Indian Ocean, off the E coast of Africa: made a French protectorate in 1895; became autonomous in 1958 and fully independent in 1960; contains unique flora and fauna. Languages: Malagasy and French. Religions: animist and Christian. Currency: franc. Capital: Ant...",
    "Malawi": "Former name : Nyasaland a republic in E central Africa: established as a British protectorate in 1891; became independent in 1964 and a republic, w...",
    "Malaysia": "a federation in SE Asia (within the Commonwealth), consisting of Peninsular Malaysia on the Malay Peninsula, and East Malaysia (Sabah and Sarawak), occupying the N part of the island of Borneo: formed in 1963 as a federation of Malaya, Sarawak, Sabah, and Singapore (the latter seceded in...",
    "Mali": "Former name (1898--1959) : French Sudan a landlocked republic in West Africa: conquered by the French by 1898 and incorporated (as French Sudan) into French West Africa; became independent in 1960; settled chiefly in the basins of the Rivers Senegal and Niger in the south. Official langu...",
    "Mauritania": "Official name : Islamic Republic of Mauritania a republic in NW Africa, on the Atlantic: established as a French protectorate in 1903 and a colony in 1920; gained independence in 1960; lies in the Sahara; contains rich resources of iron ore. Official language: Arabic; Fulani, Soninke, Wo...",
    "Mexico": "a republic in North America, on the Gulf of Mexico and the Pacific: early Mexican history includes the Maya, Toltec, and Aztec civilizations; conqu...",
    "Moldova": "a republic in SE Europe: comprising the E part of the former principality of Moldavia, the E part of which (Bessarabia) was ceded to the Soviet Union in 1940 and formed the Moldavian Soviet Socialist Republic until it gained independence in 1991; a...",
    "Morocco": "French name : Maroc a kingdom in NW Africa, on the Mediterranean and the Atlantic: conquered by the Arabs in about 683, who introduced Islam; at its height under Berber dynasties (11th--13th centuries); became a French protectorate in 1912 and gained independence in 1956. It is mostly mo...",
    "Mozambique": "a republic in SE Africa: colonized by the Portuguese from 1505 onwards and a slave-trade centre until 1878, made an overseas province of Portugal in 1951, became an independent republic in 1975, became a member of the Commonwealth in 1995. Official language: Portuguese. Religion: animist...",
    "Myanmar": "a republic in SE Asia, on the Bay of Bengal and the Andaman Sea: unified from small states in 1752; annexed by Britain (1823--85) and made a province of India in 1886; became independent in 1948. It is generally mountainous, with the basins of the Chindwin and Irrawaddy Rivers in the cen...",
    "Nepal": "Official name : Federal Democratic Republic of Nepal a republic in S Asia: the world's only Hindu kingdom until it abandoned its monarchy in 2008; united in 1768 by the Gurkhas; consists of swampy jungle in the south and great massifs, valleys, and gorges of the Himalayas over the rest o...",
    "Netherlands": "the Netherlands a kingdom in NW Europe, on the North Sea: declared independence from Spain in 1581 as the United Provinces; became a major maritime...",
    "New Zealand": "an independent dominion within the Commonwealth, occupying two main islands (the North Island and the South Island), Stewart Island, the Chatham Islands, and a number of minor islands in the SE Pacific...",
    "Nicaragua": "a republic in Central America, on the Caribbean and the Pacific: colonized by the Spanish from the 1520s; gained independence in 1821 and was annex...",
    "Niger": "a landlocked republic in West Africa: important since earliest times for its trans-Saharan trade routes, made a French colony in 1922 and became fu...",
    "Nigeria": "a republic in West Africa, on the Gulf of Guinea: Lagos annexed by the British in 1861; protectorates of Northern and Southern Nigeria formed in 1900 and united as a colony in 1914; gained independence as a member of the Commonwealth in 1960 (membership suspended from 1995 to 1999 follow...",
    "North Korea": "The most stupid nation which is ruled by dirty ruler.",
    "Norway": "Norwegian name : Norge a kingdom in NW Europe, occupying the W part of the Scandinavian peninsula: first united in the Viking age (800--1050); under the rule of Denmark (1523--1814) and Sweden (1814--1905); became an independent monarchy in 1905. Its coastline is deeply indented by fjord...",
    "Oman": "Former name (until 1970) : Muscat and Oman a sultanate in SE Arabia, on the Gulf of Oman and the Arabian Sea: the most powerful state in Arabia in the 19th century, ruling Zanzibar, much of the Persian coast, and part of Pakistan. Official language: Arabic. Official religion: Muslim. Cur...",
    "Pakistan": "a republic in S Asia, on the Arabian Sea: the Union of Pakistan, formed in 1947, comprised West and East Pakistan; East Pakistan gained independenc...",
    "Palestine State": "The country established in West Bank and Gaza Strip, including occupied Palestinian territories and those under the jurisdiction of the w:Palestinian National AuthorityPalestinian National Authority.",
    "Panama": "a republic in Central America, occupying the Isthmus of Panama: gained independence from Spain in 1821 and joined Greater Colombia; became independ...",
    "Papua New Guinea": "a country in the SW Pacific; consists of the E half of New Guinea, the Bismarck Archipelago, the W Solomon Islands, Trobriand Islands, D'Entrecasteaux Islands, Woodlark Island, and the Louisiade Archipelago; administered by Australia from 1949 until 1975, when it became an independent me...",
    "Paraguay": "an inland republic in South America: colonized by the Spanish from 1537, gaining independence in 1811;",
    "Peru": "a republic in W South America, on the Pacific: the centre of the great Inca Empire when conquered by the Spanish in 1532; gained independence in 1824 by defeating Spanish forces with armies led by San Martin and Bolivar; consists of a coastal desert, rising to the Andes; an important e...",
    "Philippines": "Republic of the Philippines a republic in SE Asia, occupying an archipelago of about 7100 islands (including Luzon, Mindanao, Samar, and Negros): became a Spanish colony in 1571 but ceded to the US in 1898 after the Spanish-American War; gained independence in ...",
    "Poland": "Polish name : Polska a republic in central Europe, on the Baltic: first united in the 10th century; dissolved after the third partition effected by Austria, Russia, and Prussia in 1795; re-established independence in 1918; invaded by Germany in 1939; ruled by a Communist government from ...",
    "Portugal": "a republic in SW Europe, on the Atlantic: became an independent monarchy in 1139 and expelled the Moors in 1249 after more than four centuries of Muslim rule; became a republic in 1910; under the dictatorship of Salazar from 1932 until 1968, when he was succeeded by Dr Caetano, who was o...",
    "Romania": "a republic in SE Europe, bordering on the Black Sea: united in 1861; became independent in 1878; Communist government set up in 1945; became a socialist republic in 1965; a more democratic regime was installed after a revolution in 1989; joined the EU in 2007. It consists chiefly of a gr...",
    "Russia": "the largest country in the world, covering N Eurasia and bordering on the Pacific and Arctic Oceans and the Baltic, Black, and Caspian Seas: origin...",
    "Rwanda": "Former name (until 1962) : Ruanda a republic in central Africa: part of German East Africa from 1899 until 1917, when Belgium took over the administration; became a republic in 1961 after a Hutu revolt against the Tutsi (1959); fighting between the ethnic groups broke out repeatedly afte...",
    "Saudi Arabia": "a kingdom in SW Asia, occupying most of the Arabian peninsula between the Persian Gulf and the Red Sea: founded in 1932 by Ibn Saud, who united Hejaz and Nejd; consists mostly of desert plateau; large reserves of petroleum and natural gas. Official language: Arabic. Official religion: (S...",
    "Senegal": "a republic in West Africa, on the Atlantic: made part of French West Africa in 1895; became fully independent in 1960; joined with The Gambia to form the Confederation of Senegambia (1982--89); mostly low-lying, with semidesert in the north and tropical forest in the southwest Official l...",
    "Serbia": "a republic in SE Europe: declared a kingdom in 1882; precipitated World War I by the conflict with Austria; became part of the Kingdom of the Serbs, Croats, and Slovenes (later called Yugoslavia) in 1918; with Montenegro formed the Federal Republic of Yugoslavia when the other constituen...",
    "Sierra Leone": "a republic in W Africa, on the Atlantic: became a British colony in 1808 and gained independence (within the Commonwealth) in 1961; declared a republic in 1971; became a one-party state in 1978; multiparty democracy restored in 1991 but military rule was imposed following a coup in 1992,...",
    "Singapore": "a republic in SE Asia, occupying one main island and over 50 small islands at the S end of the Malay Peninsula: established as a British trading po...",
    "Slovakia": "a country in central Europe: part of Hungary from the 11th century until 1918, when it united with Bohemia and Moravia to form Czechoslovakia; it became independent in 1993 and joined the EU in 2004. Official language: Slovak. Religion: Roman Catholic majority. Currency: koruna. Capital:...",
    "Somalia": "a republic in NE Africa, on the Indian Ocean and the Gulf of Aden: the north became a British protectorate in 1884; the east and south were established as an Italian protectorate in 1889; gained independence and united as Somalia (or the Somali Republic) in 1960. In 1991 the former Briti...",
    "South Africa": "Republic of South Africa a republic occupying the southernmost part of the African continent: the Dutch Cape Colony (1652) was acquired by Britain in 1806 and British victory in the Boer War resulted in the formation of the Union of South Africa in 1910, which became a republic in 1961; ...",
    "South Korea": "Korean name : Hanguk a republic in NE Asia: established as a republic in 1948; invaded by North Korea and Chinese Communists in 1950 but division remained unchanged at the end of the war (1953); includes over 3000 islands; rapid industrialization. Language: Korean. Religions: Buddhist, C...",
    "South Sudan": "A country in East Africa, formerly the southern part of Sudan.",
    "Spain": "Spanish name : Espana kingdom of SW Europe, occupying the Iberian peninsula between the Mediterranean and the Atlantic: a leading European power in the 16th century, with many overseas possessions, esp in the New World; became a republic in 1931; under the fascist dictatorship of Fran...",
    "Sri Lanka": "a republic in S Asia, occupying the island of Ceylon: settled by the Sinhalese from S India in about 550 bc; became a British colony 1802; gained independence in 1948, becoming a republic within the Commonwealth in 1972. Exports include tea, cocoa, cinnamon, and copra. Official languages...",
    "Sudan": "a republic in NE Africa, on the Red Sea: the largest country in Africa; conquered by Mehemet Ali of Egypt (1820--22) and made an Anglo-Egyptian con...",
    "Sweden": "Swedish name : Sverige a kingdom in NW Europe, occupying the E part of the Scandinavian Peninsula, on the Gulf of Bothnia and the Baltic: first united during the Viking period (8th--11th centuries); a member of the European Union. About 50 per cent of the total area is forest and 9 per c...",
    "Switzerland": "a federal republic in W central Europe: the cantons of Schwyz, Uri, and Unterwalden formed a defensive league against the Hapsburgs in 1291, later joined by other cantons; gained independence in 1499; adopted a policy of permanent neutrality from 1516; a leading centre of the Reformation...",
    "Syria": "a republic in W Asia, on the Mediterranean: ruled by the Ottoman Turks (1516--1918); made a French mandate in 1920; became independent in 1944; joi...",
    "Tajikistan": "a republic in central Asia: under Uzbek rule from the 15th century until taken over by Russia in the 1860s, it became an autonomous Soviet republic in 1929 and gained full independence from the Soviet Union in 1991; it is mainly mountainous. Official language: Tajik or Tajiki. Religion: ...",
    "Tanzania": "a republic in E Africa, on the Indian Ocean: formed by the union of the independent states of Tanganyika and Zanzibar in 1964; a member of the Commonwealth. Exports include coffee, tea, sisal, and cotton. Official languages: Swahili and English. Religions: Christian, Muslim, and animist....",
    "Thailand": "a kingdom in SE Asia, on the Andaman Sea and the Gulf of Thailand: united as a kingdom in 1350 and became a major SE Asian power; consists chiefly ...",
    "Togo": "a republic in West Africa, on the Gulf of Guinea: became French Togoland (a League of Nations mandate) after the division of German Togoland in 1922; independent since 1960. Official language: French. Religion: animist majority. ",
    "Tunisia": "a republic in N Africa, on the Mediterranean: settled by the Phoenicians in the 12th century bc; made a French protectorate in 1881 and gained independence in 1955. It consists chiefly of the Sahara in the south, a central plateau, and the Atlas Mountains in the north. Exports include te...",
    "Turkey": "A turkey is a large bird that is kept on a farm for its meat.",
    "Turkmenistan": "a republic in central Asia: the area has been occupied by a succession of empires, a Turkmen state was established in the 15th century but suffered almost continual civil strife and was gradually conquered by Russia, in 1918 it became a Soviet republic and gained independence from the So...",
    "Uganda": "a republic in E Africa: British protectorate established in 1894--96; gained independence in 1962 and became a republic in 1963; a member of the Commonwealth. It consists mostly of a savanna plateau with part of Lake Victoria in the southeast and mountains in the southwest, reaching 5109...",
    "Ukraine": "a republic in SE Europe, on the Black Sea and the Sea of Azov: ruled by the Khazars (7th--9th centuries), by Ruik princes with the Mongol conquest in the 13th century, then by Lithuania, by Poland, and by Russia; one of the four original republics that formed the Soviet Union in 1922; un...",
    "United Arab Emirates": "a group of seven emirates in SW Asia, on the Persian Gulf: consists of Abu Dhabi, Dubai, Sharjah, Ajman, Umm al Qaiwain, Ras el Khaimah, and Fujairah; a former British protectorate; became fully independent in 1971; consists mostly of flat desert, with mountains in the east; rich p...",
    "United Kingdom": "The United Kingdom is the official name for the country consisting of Great Britain and Northern Ireland.",
    "United States of America": "A federal republic mainly in North America consisting of 50 states and the District of Columbia: colonized principally by the English and French in the 17th century, the native Indians being gradually defeated and displaced; 13 colonies under British ...",
    "Uzbekistan": "a republic in central Asia: annexed by Russia in the 19th century, it became a separate Soviet Socialist republic in 1924 and gained independence in 1991. Official language: Uzbek. Religion: believers are mainly Muslim.",
    "Venezuela": "Official name : Bolivarian Republic of Venezuela a republic in South America, on the Caribbean: colonized by the Spanish in the 16th century; indep...",
    "Vietnam": "A country in Southeast Asia, on the east coast of the Indochina Peninsula, officially named Socialist Republic of Vietnam",
    "Yemen": "Official name : Yemen Republic a republic in SW Arabia, on the Red Sea and the Gulf of Aden: formed in 1990 from the union of North Yemen and South Yemen: consists of arid coastal lowlands, rising to fertile upland valleys and mountains in the west and to the Hadhramaut plateau in the SE...",
    "Zambia": "Former name (until 1964) : Northern Rhodesia a republic in southern Africa: an early site of human settlement; controlled by the British South Africa Company by 1900 and unified as Northern Rhodesia in 1911; made a British protectorate in 1924; part of the Federation of Rhodesia and Nyas...",
    "Zimbabwe": "a country in SE Africa, formerly a self-governing British colony founded in 1890 by the British South Africa Company, which administered the countr..."
}