{
    "aerobatics": "Aerobatics are skillful displays of flying, usually to entertain people watching from the ground.",
    "archery": "Archery is a sport in which people shoot arrows at a target using a bow.",
    "athletics": "Athletics refers to track and field sports such as running, the high jump, and the javelin.",
    "badminton": "Badminton is a game played by two or four players on a rectangular court with a high net across the middle. The players try to score points by hitting a small object called a shuttlecock across the net using a racket.",
    "baseball": "In America, baseball is a game played by two teams of nine players. Each player from one team hits a ball with a bat and then tries to run aroun...",
    "basketball": "Basketball is a game in which two teams of five players each try to score goals by throwing a large ball through a circular net fixed to a metal...",
    "bobsledding": "The act or sport of riding a bobsled",
    "bodybuilding": "Bodybuilding is the activity of doing special exercises regularly in order to make your muscles grow bigger.",
    "bowling": "Bowling is a game in which you roll a heavy ball down a narrow track towards a group of wooden objects and try to knock down as many of them as ...",
    "boxing": "Boxing is a sport in which two people wearing large padded gloves fight according to special rules.",
    "bungee jumping": "If someone goes bungee jumping, they jump from a high place such as a bridge or cliff with a long piece of strong elastic cord tied around their ankle connecting them to the bridge or cliff.",
    "canoeing": "Canoeing is the sport of using and racing a canoe.",
    "cricket": "Cricket is an outdoor game played between two teams. Players try to score points, called runs, by hitting a ball with a wooden bat.",
    "croquet": "Croquet is a game played on grass in which the players use long wooden sticks called mallets to hit balls through metal arches.",
    "curling": "a game played on ice, esp in Scotland and Canada, in which heavy stones with handles (curling stones) are slid towards a target (tee)",
    "cycling": "The quiet country roads are ideal for cycling.",
    "darts": "any of various competitive games in which darts are thrown at a dartboard",
    "diving": "Diving is the activity of working or looking around underwater, using special breathing equipment.",
    "dogsled racing": "A race is a competition to see who is the fastest, for example in running, swimming, or driving.",
    "fencing": "Fencing is a sport in which two competitors fight each other using very thin swords. The ends of the swords are covered and the competitors wear...",
    "field hockey": "Field hockey is an outdoor game played on a grass field between two teams of 11 players who use long curved sticks to hit a small ball and try to score goals.",
    "figure skating": "Figure skating is skating in an attractive pattern, usually with spins and jumps included.",
    "fishing": "Fishing is the sport, hobby, or business of catching fish.",
    "football": "Football is a game played by two teams of eleven players using a round ball. Players kick the ball to each other and try to score goals ...",
    "gliding": "Gliding is the sport or activity of flying in a glider.",
    "golf": "Golf is a game in which you use long sticks called clubs to hit a small, hard ball into holes that are spread out over a large area of grassy land.",
    "handball": "In Britain, handball is a team sport in which the players try to score goals by throwing or hitting a large ball with their hand.",
    "hang gliding": "Hang-gliding is the activity of flying in a hang-glider.",
    "hiking": "heavy hiking boots.",
    "horse racing": "Horse racing is a sport in which horses ridden by people called jockeys run in races, sometimes jumping over fences.",
    "ice hockey": "Ice hockey is a game played on ice between two teams of 11 players who use long curved sticks to hit a small rubber disk, called a puck, and try to score goals.",
    "ice skating": "If you go ice-skating, you move about on ice wearing ice-skates. This activity is also a sport.",
    "kabaddi": "a game played between two teams of seven players, in which individuals take turns to chase and try to touch members of the opposing team without being captured by them",
    "lacrosse": "Lacrosse is an outdoor game in which players use long sticks with nets at the end to catch and throw a small ball, in order to try and score goals.",
    "marathon": "A marathon is a race in which people run a distance of 26 miles, which is about 42 km.",
    "mountaineering": "Mountaineering is the activity of climbing the steep sides of mountains as a hobby or sport.",
    "orienteering": "Orienteering is a sport in which people run from one place to another, using a compass and a map to guide them between points that are marked along the route.",
    "paragliding": "Hang gliding and paragliding are allowed from the top of Windy Hill.",
    "powerlifting": "a form of weightlifting in which contestants compete in the dead lift, squat, and bench press",
    "racing": "Racing refers to races between animals, especially horses, or between vehicles.",
    "racquetball": "A certain sport, similar to squash, but played with a bigger ball.",
    "rhythmic gymnastics": "A form of gymnastics involving movements using hand apparatus such as balls, hoops, and ribbons",
    "rodeo": "In the United States, a rodeo is a public entertainment event in which cowboys show different skills, including riding wild horses and catching cattle with ropes.",
    "rollerskating": "The craze for roller skating spread throughout the U.S.",
    "rugby": "Rugby or rugby football is a game played by two teams using an oval ball. Players try to score points by carrying the ball to their opponents' end of the field, or by kicking it over a bar fixed between two posts.",
    "shooting": "A shooting is an occasion when someone is killed or injured by being shot with a gun.",
    "skating": "They all went skating together in the winter.",
    "skeleton": "Your skeleton is the framework of bones in your body.",
    "ski jumping": "A winter sport in which skiers ski down a take-off ramp and attempt to jump as far as possible.",
    "skibobbing": "A winter sport involving a bicycle-type frame attached to skis instead of wheels.",
    "skiing": "My hobbies were skiing and scuba diving.",
    "skin diving": "the sport or activity of diving and underwater swimming without wearing a diver's costume",
    "skydiving": "Skydiving is the sport of jumping out of an aeroplane and falling freely through the air before opening your parachute.",
    "snowboarding": "Snowboarding is the sport or activity of travelling down snowy slopes using a snowboard.",
    "soccer": "Soccer is a game played by two teams of eleven players using a round ball. Players kick the ball to each other and try to score goals by kicking the ball into a large net. Outside the USA, this game is also referred to as football.",
    "softball": "Softball is a game similar to baseball, but played with a larger, softer ball.",
    "speed skating": "a form of ice skating in which contestants race against each other or the clock over various distances",
    "speed skiing": "The speed events of formal alpine skiing, the speed disciplines of super-G and downhill. (The technical events of the sport of alpi...",
    "sumo": "Sumo is the Japanese style of wrestling.",
    "swimming": "Swimming is the activity of swimming, especially as a sport or for pleasure.",
    "table tennis": "Table tennis is a game played inside by two or four people. The players stand at each end of a table which has a low net across the middle and hit a small light ball over the net, using small bats.",
    "taekwondo": "a Korean martial art that resembles karate",
    "tennis": "Tennis is a game played by two or four players on a rectangular court. The players use an oval bat with strings across it to hit a ball over a net across the middle of the court.",
    "volleyball": "Volleyball is a game in which two teams hit a large ball with their hands backwards and forwards over a high net. If you allow the ball to touch the ground, the other team wins a point.",
    "water polo": "Water polo is a game played in a swimming pool in which two teams of swimmers try to score goals with a ball.",
    "waterskiing": "He offered to teach them water-skiing.",
    "weight throw": "the maximum weight of supplementary mechanisms that can be lifted by the boost stages of a particular missile",
    "weightlifting": "Weightlifting is a sport in which the competitor who can lift the heaviest weight wins.",
    "windsurfing": "Windsurfing is a sport in which you move along the surface of the sea or a lake on a long narrow board with a sail on it.",
    "wrestling": "Wrestling is a sport in which two people wrestle and try to throw each other to the ground."
}