{
    "air gun": "a gun discharged by means of compressed air",
    "bayonet": "A bayonet is a long, sharp blade that can be fixed to the end of a rifle and used as a weapon.",
    "bazooka": "A bazooka is a long, tube-shaped gun that is held on the shoulder and fires rockets.",
    "big bertha": "any of three large German guns of World War I used to bombard Paris",
    "blunderbuss": "an obsolete short musket with large bore and flared muzzle, used to scatter shot at short range",
    "bomb": "A bomb is a device which explodes and damages or destroys a large area.",
    "bowie knife": "a stout hunting knife with a short hilt and a guard for the hand",
    "cannon": "A cannon is a large gun, usually on wheels, which used to be used in battles.",
    "carbine": "A carbine is a light automatic rifle.",
    "crossbow": "A crossbow is a weapon consisting of a small, powerful bow that is fixed across a piece of wood, and aimed like a gun.",
    "depth charge": "A depth charge is a type of bomb which explodes under water and which is used especially to destroy enemy submarines.",
    "flame thrower": "A flame-thrower is a gun that can send out a stream of burning liquid and that is used as a weapon or for clearing plants from an area of ground.",
    "gatling gun": "a hand-cranked automatic machine gun equipped with a rotating cluster of barrels that are fired in succession using brass cartridges",
    "grenade launcher": "A weapon that shoots grenades from a device.",
    "gun": "A gun is a weapon from which bullets or other things are fired.",
    "halberd": "a weapon consisting of a long shaft with an axe blade and a pick, topped by a spearhead: used in 15th- and 16th-century warfare",
    "handgun": "A handgun is a gun that you can hold, carry, and fire with one hand.",
    "improvised explosive device": "abbr IED a home-made explosive device designed to maim, harass, or kill",
    "lance": "If a boil on someone's body is lanced, a small cut is made in it so that the liquid inside comes out.",
    "land mine": "an explosive charge placed in the ground, usually detonated by stepping or driving on it",
    "machine gun": "A machine gun is a gun which fires a lot of bullets one after the other very quickly.",
    "mine": "Mine is the first person singular possessive pronoun. A speaker or writer uses mine to refer to something that belongs or relates to himself or herself.",
    "mortar": "A mortar is a big gun which fires missiles high into the air over a short distance.",
    "musket": "A musket was an early type of gun with a long barrel, which was used before rifles were invented.",
    "nightstick": "A nightstick is a short thick club that is carried by policemen in the United States.",
    "onager": "a Persian variety of the wild ass, Equus hemionus Compare kiang",
    "pike": "A pike is a large fish that lives in rivers and lakes and eats other fish.",
    "pistol": "A pistol is a small gun.",
    "quarterstaff": "a stout iron-tipped wooden staff about 6ft long, formerly used in England as a weapon",
    "revolver": "A revolver is a kind of hand gun. Its bullets are kept in a revolving cylinder in the gun.",
    "rifle": "A rifle is a gun with a long barrel.",
    "rocket launcher": "A rocket launcher is a device that can be carried by soldiers and used for firing rockets.",
    "scimitar": "A scimitar is a sword with a curved blade that was used in former times in some Eastern countries.",
    "shotgun": "A shotgun is a gun used for shooting birds and animals which fires a lot of small metal balls at one time.",
    "sling": "If you sling something somewhere, you throw it there carelessly.",
    "spear": "A spear is a weapon consisting of a long pole with a sharp metal point attached to the end.",
    "stun gun": "a device designed to immobilize an animal or person temporarily without inflicting serious injury",
    "submachine gun": "A sub-machine gun is a light portable type of machine gun.",
    "sword": "A sword is a weapon with a handle and a long sharp blade.",
    "thermonuclear warhead": "the warhead of a missile designed to deliver an atom bomb",
    "torpedo": "A torpedo is bomb that is shaped like a tube and that travels under water.",
    "trebuchet": "A medieval siege engine consisting of a large pivoting arm heavily weighted on one end. Considered to be the technological successor to the ..."
}